In [10]:
import pandas as pd

In [11]:
# crear una serie a partir de una lista de 10 nombres distintos
lista = ['Juan', 'Pedro', 'Maria', 'Jose', 'Ana', 'Luis', 'Marta', 'Rosa', 'Lorena', 'Sofia']

In [12]:
s = pd.Series(lista,dtype=str)
s

0      Juan
1     Pedro
2     Maria
3      Jose
4       Ana
5      Luis
6     Marta
7      Rosa
8    Lorena
9     Sofia
dtype: object

In [13]:
# crear una serie a partir de un diccionario de 10 nombres distintos donde la clave es el indice numerico y el valor es el nombre
diccionario = {0:'Juan', 1:'Pedro', 2:'Maria', 3:'Jose', 4:'Ana', 5:'Luis', 6:'Marta', 7:'Rosa', 8:'Lorena', 9:'Sofia'}

p = pd.Series(diccionario)
p

0      Juan
1     Pedro
2     Maria
3      Jose
4       Ana
5      Luis
6     Marta
7      Rosa
8    Lorena
9     Sofia
dtype: object

In [14]:
p.describe()

count       10
unique      10
top       Juan
freq         1
dtype: object

In [15]:
ciudades_df = pd.read_csv('cities.csv')
ciudades_df.head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

In [16]:
ciudades_df.shape

(128, 10)

In [17]:
ciudades_df.columns

Index(['LatD', ' "LatM"', ' "LatS"', ' "NS"', ' "LonD"', ' "LonM"', ' "LonS"',
       ' "EW"', ' "City"', ' "State"'],
      dtype='object')

In [18]:
# actualizar el nombre de las columnas a camelCase y borrar espacios y comillas dobles

ciudades_df.columns = [nombre.replace(' ', '').replace('"', '') for nombre in ciudades_df.columns]

# si pasamos todo a minusculas se puede llamar a la columna con el nombre original luego de un "."
ciudades_df.columns = [nombre.lower() for nombre in ciudades_df.columns]

In [19]:
ciudades_df.columns

Index(['latd', 'latm', 'lats', 'ns', 'lond', 'lonm', 'lons', 'ew', 'city',
       'state'],
      dtype='object')

In [20]:
ciudades_df['city']

0            "Youngstown"
1               "Yankton"
2                "Yakima"
3             "Worcester"
4       "Wisconsin Dells"
              ...
123                "Reno"
124              "Regina"
125           "Red Bluff"
126             "Reading"
127             "Ravenna"
Name: city, Length: 128, dtype: object

In [21]:
ciudades_df.city

0            "Youngstown"
1               "Yankton"
2                "Yakima"
3             "Worcester"
4       "Wisconsin Dells"
              ...
123                "Reno"
124              "Regina"
125           "Red Bluff"
126             "Reading"
127             "Ravenna"
Name: city, Length: 128, dtype: object

In [32]:
ciudades_df.to_csv('formateados_ciuades.csv', index=False)

In [33]:
ciudades_df.lond.mean()

93.25

In [35]:
# mascara para seleccionar ciudades con el hemisferio norte
ciudades_df.loc[ciudades_df.latd > 42,['city','latd']].head(10)

                  city  latd
2             "Yakima"    46
4    "Wisconsin Dells"    43
6           "Winnipeg"    49
10         "Williston"    48
17         "Wenatchee"    47
20            "Wausau"    44
22         "Watertown"    44
23         "Watertown"    43
28       "Walla Walla"    46
33         "Vancouver"    49

In [ ]:
with open('videojuegos2.csv', 'r') as archivo:
    lineas = f.readlines()